In [5]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\lenovo\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [7]:
# Creating a Series from a list 
import pandas as pd
data = [10,20,30 ,40]
series = pd.Series(data , index = ['A','B','C','D'] )
print(series)

A    10
B    20
C    30
D    40
dtype: int64

In [13]:
#Accessing data in series by index and position

print(series['A'])
print(series[1])

10
20

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_8036\3165160280.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(series[1])

In [15]:
#Creating a DataFrame

data={"Name":["Abs","Sam","Jon"],"Age":[29,30,32],"Score":[79,90,91]}

df=pd.DataFrame(data)
print(df)

  Name  Age  Score
0  Abs   29     79
1  Sam   30     90
2  Jon   32     91

In [31]:
#Accesing Data in a DataFrame 

print("Access a Column")
print(df["Name"])
print("")

print("Access a Row") 
print(df.loc[2])
print("")

print("Access a Specific Value")
print(df.at[1,"Age"])
print("")

Access a Column
0    Abs
1    Sam
2    Jon
Name: Name, dtype: object

Access a Row
Name     Jon
Age       32
Score     91
Name: 2, dtype: object

Access a Specific Value
30

In [39]:
# DataFrame SubTypes:

print("Column")
print(df.columns)
print("")

print("Index")
print(df.index)
print("")

print("Shape")
print(df.shape)
print("")

print("Size")
print(df.size)
print("")

print("information")
print(df.info)
print("")

print("Describe")
print(df.describe)
print("")

Column
Index(['Name', 'Age', 'Score'], dtype='object')

Index
RangeIndex(start=0, stop=3, step=1)

Shape
(3, 3)

Size
9

information
<bound method DataFrame.info of   Name  Age  Score
0  Abs   29     79
1  Sam   30     90
2  Jon   32     91>

Describe
<bound method NDFrame.describe of   Name  Age  Score
0  Abs   29     79
1  Sam   30     90
2  Jon   32     91>

In [83]:
#Accessing Data using .loc[] , .iloc[] , .at[] and .iat[]

print(df)
print("")

print(df.loc[2,"Name"])
print("")

print(df.iloc[2,1])
print("")

print(df.at[1,"Name"])
print("")

print(df.iat[2,2])
print("")

  Name  Age  Score
0  Abs   29     79
1  Sam   30     90
2  Jon   32     91

Jon

32

Sam

91

In [101]:
#Accessing Columns by ShortHand

print(df)

df['Age']

  Name  Age  Score
0  Abs   29     79
1  Sam   30     90
2  Jon   32     91

0    29
1    30
2    32
Name: Age, dtype: int64

In [103]:
#Accessing Columns by Dot Notation

print(df)

df.Name

  Name  Age  Score
0  Abs   29     79
1  Sam   30     90
2  Jon   32     91

0    Abs
1    Sam
2    Jon
Name: Name, dtype: object

In [138]:
#Transforming Data by using Apply

data = pd.Series([1,2,3,4,5])
result = data.apply(lambda x : x**2) 
print(result)

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [153]:
#Inserting a Column 

#df.insert(0,'Gender','male')
print(df)

  Gender Name  Age  Score
0   Male  Abs   29     79
1   Male  Sam   30     90
2   Male  Jon   32     91

In [214]:
#Dropping Column

#df.drop('Gender', axis = 1 , inplace = True)

In [163]:
print(df)

  Name  Age  Score
0  Abs   29     79
1  Sam   30     90
2  Jon   32     91

In [169]:
#Renaming Column

df.rename(columns = {'Name':'Full Name'},inplace = True)

print(df)

  Full Name  Age  Score
0       Abs   29     79
1       Sam   30     90
2       Jon   32     91

In [175]:
#Merging DataFrames : Inner , Outer , Left , Right Joins

df1 = pd.DataFrame({'key':[1,2,3],'Subject':['English','Maths','History']})

df2 = pd.DataFrame({'key':[2,3,4],'Mode':['Online','Online','Offline']})

print(df1)
print(df2)

   key  Subject
0    1  English
1    2    Maths
2    3  History
   key     Mode
0    2   Online
1    3   Online
2    4  Offline

In [179]:
#Inner Join

result = pd.merge(df1 , df2 , how = 'inner',on='key')
print(result)

   key  Subject    Mode
0    2    Maths  Online
1    3  History  Online

In [181]:
#Outer Join 

result = pd.merge(df1 , df2 , how = 'outer',on='key')
print(result)

   key  Subject     Mode
0    1  English      NaN
1    2    Maths   Online
2    3  History   Online
3    4      NaN  Offline

In [183]:
#Left Join 

result = pd.merge(df1 , df2 , how = 'left',on='key')
print(result)

   key  Subject    Mode
0    1  English     NaN
1    2    Maths  Online
2    3  History  Online

In [185]:
#Right Join 

result = pd.merge(df1 , df2 , how = 'right',on='key')
print(result)

   key  Subject     Mode
0    2    Maths   Online
1    3  History   Online
2    4      NaN  Offline

In [225]:
#Handling Null Values 

df.isnull()

   Full Name   Age  Score
0       True  True   True
1       True  True   True
2       True  True   True

In [227]:
df.notnull()

   Full Name   Age  Score
0       True  True   True
1       True  True   True
2       True  True   True

In [233]:
df.dropna()

  Full Name  Age  Score
0       Abs   29     79
1       Sam   30     90
2       Jon   32     91

In [235]:
print(df)

  Full Name  Age  Score
0       Abs   29     79
1       Sam   30     90
2       Jon   32     91

In [290]:
data1={"Name":["Abs","Sam","Jon",""],"Age":[29,30,32,0],"Score":[79,90,91,0]}

df=pd.DataFrame(data1)
print(df)

  Name  Age  Score
0  Abs   29     79
1  Sam   30     90
2  Jon   32     91
3         0      0